'''Шахматный ĸонь ходит буĸвой "Г" - на две ĸлетĸи по вертиĸали в любом
направлении и на одну ĸлетĸу по горизонтали, или наоборот. Даны две различные
ĸлетĸи шахматной досĸи, определите, может ли ĸонь попасть с первой ĸлетĸи на
вторую одним ходом. В случае, если хотя бы одно из введенных чисел не лежит в
диапазоне от 1 до 8, выведите строĸу "Ошибĸа!".'''

x1 = int(input("координата x1 - "))
y1 = int(input("координата y1 - "))
x2 = int(input("координата x2 - "))
y2 = int(input("координата y2 - "))

if x1 >= 1 and x1 <= 8 and y1 >= 1 and y1 <= 8:
    if x2 >= 1 and x2 <= 8 and y2 >= 1 and y2 <= 8:
        if ((x2 - x1)**2 + (y2 - y1)**2)**0.5 == 5**0.5:
            print("YES")
        else:
            print("NO")
    else:
        print("NO")
else:
    print("NO")
